/*
    クラス記号：AT11D419
    出席番号　:21
    学籍番号  :40726
    氏名      :田島心葉
    概要　　　:画像出力の確認

    作成開始日:2025/01/27
*/
#include"conioex_New.h"
#include"Game.h"
using namespace std;

int main() {
    // 画面サイズ,文字サイズの設定
    InitConioEx(640, 512, 1, 1, true);

    

    // 構造体定義
    Player p = {
        true,
        {1},// 名前
        1,// 性別
        1,// 職業
        1,// レベル
        0,// 累計経験値
        5,// HP
        5,// HPMAX
        5,
        5,
        5,
        5,
        0,
        1,
        0,
        1000,
        0,
        0,
        // 座標
        0,
        0,
        288,
        319,
        448,
        479,
        0,
        1,
        64,
        127,
        384,
        447,
        {32,32},
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        {1,1,1,2,2,2,1,1,1,1,3,3,3,1,1,0xff},
        {0,0,1,1,2,2,3,3,4,4,5,5,0xff},
        {0,1,1,2,2,3,3,0xff},
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        {1,0},// マップ変更フラグ、次に移動するマップ
        0,// nowMap;
        0,
        0,

        // イベントフラグ一覧
        {0,0,0,0,0},
        0,

        100,
        0,
        // テキスト関係
        {1,1,0},
        // サウンド
        {0,0,0,0,0,0,0,0},
        0,
        0,
        0,
        0,
        0,
        1,
    };
    Enemy e = {
        //0：HP,1:ATK,2:Left,3:Right,4:Top,5:Bottom,6:向き,7:最大HP
        {{2,1,575,639,384,447,-1,2},// チュートリアル
        {3,1,575,639,384,447,-1,3},// 平原
        { 10,1,575,639,384,447,-1,10 },// 森
        { 10,1,575,639,384,447,-1,10 },// 魔王１
        { 10,1,288,352,32,96,-1,10 },// 魔王２
        {15,1,575,639,384,447,-1,15}},// 魔王３
        1,
        0,
        3,
        0,
        0,
        0,
        0,
        {0,0,0,1,1,1,2,2,2,3,3,3,4,4,4,5,5,5,0xff},
        {{0,0,0,0,0},// 魔法弾　0:存在フラグ,1:Left,2:Top,3:Right,4:Bottom,
         {0,0,0,0,0},
         {0,0,0,0,0},
         {0,0,0,0,0},
         {0,0,0,0,0},},
         0,
         0,
    };
    Pic pic = {
    NULL,
    NULL,
    // プレイヤー　バトルマップ
    NULL,
    NULL,
        {NULL,NULL,NULL,NULL,NULL,NULL},
        {NULL,NULL,NULL,NULL,NULL,NULL},
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    // バトルエフェクト
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    // プレイヤー　フィールドマップ
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    // 暗転素材
    NULL,
    // 敵キャラ
    NULL,
    NULL,
    // バトルマップ用画像
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,

    NULL,

    NULL,
    NULL,
    NULL,
    // 背景画像
    NULL,
    NULL,

    // エネミー
        NULL,
        NULL,
        {NULL,NULL,NULL,NULL,NULL,NULL},
        {NULL,NULL,NULL,NULL,NULL,NULL},
        {NULL,NULL},

        {NULL,NULL,NULL,NULL,NULL,NULL},
        {NULL,NULL,NULL,NULL,NULL,NULL},
        {NULL,NULL,NULL,NULL,NULL,NULL},
        {NULL,NULL,NULL,NULL,NULL,NULL},
        {NULL,NULL,NULL,NULL,NULL,NULL},
        {NULL,NULL,NULL},
        {NULL,NULL},
        {NULL,NULL,NULL,NULL,NULL,NULL,NULL},
        {NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL},
    // 立ち絵
        NULL,
        NULL,
        NULL,
        NULL,
        NULL,
        NULL,
        {NULL,NULL,NULL,NULL,NULL,NULL},
    };
    Key key = {
        0,0,0,
        0,0,0,
        0,0,0,
        0,0,0,
        0,0,0,
        0,0,0,
        0,0,0,
        0,0,0,
    };
    Map map = {
        // stage0
        {{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}},
        // stage1
        {{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,1,1,1,1,1,1,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2}},
        // ラスボス戦１
        {{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}},
        // 王都マップ
        // 1,2:道, 3:地面, 4:城壁, 5,6:マップ移動箇所, 7~:会話ポイント
        {{4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4},
        {4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4},
        {4,4,4,4,4,4,4,4,4,8,8,4,4,4,4,4,4,4,4,4},
        {7,7,7,7,7,7,7,7,3,1,2,3,7,7,7,7,7,7,7,7},
        {7,7,7,7,7,7,7,7,3,1,2,3,7,7,7,7,7,7,7,7},
        {3,9,3,3,11,3,3,3,3,1,2,3,3,3,13,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,1,2,3,3,3,3,3,3,3,15,3},
        {7,7,7,7,7,7,7,7,3,1,2,3,7,7,7,7,7,7,7,7},
        {7,7,7,7,7,7,7,7,3,1,2,3,7,7,7,7,7,7,7,7},
        {7,7,7,7,7,7,7,7,3,1,2,3,7,7,7,7,7,7,7,7},
        {7,7,7,7,7,7,7,7,3,1,2,3,7,7,7,7,7,7,7,7},
        {7,7,7,7,7,7,7,7,3,1,2,3,7,7,7,7,7,7,7,7},
        {3,3,10,3,3,3,3,3,3,1,2,3,3,3,3,3,3,14,3,3},
        {3,3,3,3,3,3,3,3,3,1,2,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,1,2,3,3,12,3,3,3,3,3,3},
        {4,4,4,4,4,4,4,4,4,5,6,4,4,4,4,4,4,4,4,4}},
        // 草原マップ
        {{3,3,3,3,3,3,3,3,3,5,5,3,3,3,3,3,3,3,3,3},
        {3,1,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,3},
        {3,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,3},
        {3,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,3},
        {3,1,1,1,1,1,1,1,1,1,1,1,1,1,2,1,1,1,1,3},
        {3,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1,1,1,3},
        {3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,3},
        {3,1,1,1,1,1,1,1,1,1,1,2,1,1,1,1,1,1,1,5},
        {3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,5},
        {3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,3},
        {3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,3},
        {3,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,3},
        {3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,3},
        {3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,1,1,1,3},
        {3,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,3},
        {3,3,3,3,3,3,3,3,3,5,5,3,3,3,3,3,3,3,3,3}},
        // 森マップ
        {{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,1,1,1,1,1,3,1,1,1,1,3,1,1,1,1,1,1,1,6},
        {3,1,3,3,3,1,3,3,1,3,1,3,1,3,3,3,1,3,3,3},
        {3,1,1,1,3,1,1,1,1,3,1,3,1,3,1,1,1,1,1,3},
        {3,3,3,1,3,3,3,3,3,3,1,3,1,3,1,3,3,3,3,3},
        {3,1,1,1,3,1,1,1,1,3,1,3,1,3,1,3,1,1,1,3},
        {3,1,3,3,3,1,3,1,3,3,1,3,3,3,1,3,1,3,1,3},
        {3,1,3,2,2,2,3,1,1,3,1,1,1,3,1,3,1,3,1,3},
        {3,1,3,3,3,1,3,3,1,3,3,3,1,3,1,1,1,3,1,3},
        {3,1,1,1,3,1,3,1,1,1,1,3,1,3,3,3,3,3,1,3},
        {3,1,3,1,3,3,3,3,3,3,1,3,1,3,1,1,1,1,1,3},
        {3,3,3,1,3,1,1,1,1,1,1,3,1,3,3,3,3,3,1,3},
        {3,1,1,1,3,1,3,3,3,3,3,3,1,1,1,1,1,1,1,3},
        {3,1,3,3,3,1,3,1,1,1,1,3,3,3,3,3,3,3,1,3},
        {5,1,3,1,1,1,1,1,3,3,1,1,1,1,1,1,1,1,1,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3}},
        // 国境マップ
        {{3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3},
        {3,3,3,3,3,3,3,3,3,8,9,3,3,3,3,3,3,3,3,3},
        {7,0,0,0,0,0,0,0,0,1,2,0,0,0,0,0,0,0,0,7},
        {7,0,0,0,0,0,0,0,0,1,2,0,0,0,0,0,0,0,0,7},
        {7,0,0,0,0,0,0,0,0,1,2,0,0,0,0,0,0,0,0,7},
        {7,0,0,0,0,0,0,0,0,1,2,0,0,0,0,0,0,0,0,7},
        {7,0,0,0,0,0,0,0,0,1,2,0,0,0,0,0,0,0,0,7},
        {7,0,0,0,0,0,0,0,0,1,2,0,0,0,0,0,0,0,0,7},
        {7,0,0,0,0,0,0,0,0,1,2,0,0,0,0,0,0,0,0,7},
        {7,0,0,0,0,0,0,0,0,1,2,0,0,0,0,0,0,0,0,7},
        {7,7,7,7,7,7,7,7,7,5,6,7,7,7,7,7,7,7,7,7}},
    };
    // 画像読み込み
    pic.textbox = LoadBmp("pic/textbox.bmp");
    pic.choice = LoadBmp("pic/choice.bmp");
    pic.menu_back = LoadBmp("pic/title/BUCK.bmp");
    pic.menu_title = LoadBmp("pic/title/TITLE.bmp");
    // バトルマップ用プレイヤー画像
    pic.b_r = LoadBmp("pic/b_p/右待機.bmp");
    pic.b_l = LoadBmp("pic/b_p/左待機.bmp");

    pic.b_r_run[0] = LoadBmp("pic/b_p/右走り１.bmp");
    pic.b_r_run[1] = LoadBmp("pic/b_p/右走り２.bmp");
    pic.b_r_run[2] = LoadBmp("pic/b_p/右走り３.bmp");
    pic.b_r_run[3] = LoadBmp("pic/b_p/右走り４.bmp");
    pic.b_r_run[4] = LoadBmp("pic/b_p/右走り５.bmp");
    pic.b_r_run[5] = LoadBmp("pic/b_p/右走り６.bmp");
    pic.b_l_run[0] = LoadBmp("pic/b_p/左走り１.bmp");
    pic.b_l_run[1] = LoadBmp("pic/b_p/左走り２.bmp");
    pic.b_l_run[2] = LoadBmp("pic/b_p/左走り３.bmp");
    pic.b_l_run[3] = LoadBmp("pic/b_p/左走り４.bmp");
    pic.b_l_run[4] = LoadBmp("pic/b_p/左走り５.bmp");
    pic.b_l_run[5] = LoadBmp("pic/b_p/左走り６.bmp");
    
    pic.b_r_run1 = LoadBmp("pic/b_p/右走り１.bmp");
    pic.b_r_run2 = LoadBmp("pic/b_p/右走り２.bmp");
    pic.b_r_run3 = LoadBmp("pic/b_p/右走り３.bmp");
    pic.b_r_run4 = LoadBmp("pic/b_p/右走り４.bmp");
    pic.b_r_run5 = LoadBmp("pic/b_p/右走り５.bmp");
    pic.b_r_run6 = LoadBmp("pic/b_p/右走り６.bmp");
    pic.b_l_run1 = LoadBmp("pic/b_p/左走り１.bmp");
    pic.b_l_run2 = LoadBmp("pic/b_p/左走り２.bmp");
    pic.b_l_run3 = LoadBmp("pic/b_p/左走り３.bmp");
    pic.b_l_run4 = LoadBmp("pic/b_p/左走り４.bmp");
    pic.b_l_run5 = LoadBmp("pic/b_p/左走り５.bmp");
    pic.b_l_run6 = LoadBmp("pic/b_p/左走り６.bmp");
    pic.b_zan1 = LoadBmp("pic/b_p/斬撃１.bmp");
    pic.b_zan2 = LoadBmp("pic/b_p/斬撃２.bmp");
    pic.b_zan3 = LoadBmp("pic/b_p/斬撃３.bmp");
    // バトルマップ用敵キャラ画像
    pic.e_0 = LoadBmp("pic/enemy.bmp");
    pic.e_1 = LoadBmp("pic/enemy/enemy1_1.bmp");
    // バトルマップ用画像
    pic.c_1 = LoadBmp("pic/mapchip/mapchip1.bmp");
    pic.c_2 = LoadBmp("pic/mapchip/mapchip2.bmp");
    pic.c_3 = LoadBmp("pic/mapchip/mapchip3.bmp");
    pic.c_4 = LoadBmp("pic/mapchip/mapchip4.bmp");
    pic.hp = LoadBmp("pic/HP.bmp");
    pic.b_clear = LoadBmp("pic/b_p/クリア画面.bmp");
    pic.b_blood1 = LoadBmp("pic/b_p/血.bmp");
    // フィールドマップ用画像
    pic.f_1 = LoadBmp("pic/fieldmap/s_1.bmp");
    pic.f_2 = LoadBmp("pic/fieldmap/s_2.bmp");
    pic.f_3 = LoadBmp("pic/fieldmap/s_3.bmp");
    pic.f_black = LoadBmp("pic/fieldmap/black.bmp");
    pic.k_1 = LoadBmp("pic/fieldmap/k_1.bmp");
    pic.k_2 = LoadBmp("pic/fieldmap/k_2_l.bmp");
    pic.k_3 = LoadBmp("pic/fieldmap/k_3_r.bmp");
    pic.k_4 = LoadBmp("pic/fieldmap/k_4.bmp");
    pic.k_kisi = LoadBmp("pic/fieldmap/kisi.bmp");
    pic.house= LoadBmp("pic/fieldmap/house1.bmp");
    pic.npc1_f = LoadBmp("pic/npc/mobchara1.bmp");
    // フィールドマップ用プレイヤー画像
    pic.p1_f_r1 = LoadBmp("pic/Player1/右１.bmp");
    pic.p1_f_r2 = LoadBmp("pic/Player1/右２.bmp");
    pic.p1_f_r3 = LoadBmp("pic/Player1/右３.bmp");
    pic.p1_f_l1 = LoadBmp("pic/Player1/左１.bmp");
    pic.p1_f_l2 = LoadBmp("pic/Player1/左２.bmp");
    pic.p1_f_l3 = LoadBmp("pic/Player1/左３.bmp");
    pic.p1_f_u1 = LoadBmp("pic/Player1/上１.bmp");
    pic.p1_f_u2 = LoadBmp("pic/Player1/上２.bmp");
    pic.p1_f_u3 = LoadBmp("pic/Player1/上３.bmp");
    pic.p1_f_d1 = LoadBmp("pic/Player1/下１.bmp");
    pic.p1_f_d2 = LoadBmp("pic/Player1/下２.bmp");
    pic.p1_f_d3 = LoadBmp("pic/Player1/下３.bmp");

    // 立ち絵
    pic.tatie_p = LoadBmp("pic/立ち絵/tatie_player.bmp");
    pic.tatie_maou = LoadBmp("pic/立ち絵/tatie_maou.bmp");
    pic.tatie_king = LoadBmp("pic/立ち絵/tatie_king.bmp");
    pic.tatie_npc = LoadBmp("pic/立ち絵/tatie_npc.bmp");
    pic.tatie_kisi = LoadBmp("pic/立ち絵/tatie_kisi.bmp");

    pic.e2_t1[0] = LoadBmp("pic/text/E2/text1.bmp");
    pic.e2_t1[1] = LoadBmp("pic/text/E2/text2.bmp");
    pic.e2_t1[2] = LoadBmp("pic/text/E2/text3.bmp");
    pic.e2_t1[3] = LoadBmp("pic/text/E2/text4.bmp");
    pic.e2_t1[4] = LoadBmp("pic/text/E2/text5.bmp");
    pic.e2_t1[5] = LoadBmp("pic/text/E2/text6.bmp");
    pic.e2_t1[6] = LoadBmp("pic/text/E2/text7.bmp");

    p.se_attack = MciOpenSound("sound/se/attack.mp3");
    p.se_damage = MciOpenSound("sound/se/damage.mp3");
    p.se_fire = MciOpenSound("sound/se/fire.mp3");
    p.se_jump1 = MciOpenSound("sound/se/jump1.mp3");
    p.se_jump2 = MciOpenSound("sound/se/jump2.mp3");
    while (p.gameloop == true) {
        srand(time(NULL));

        // Bmp画像の定義と破棄
        if (p.changemap[0] == 1) {
            BmpScan(&p, &pic);
        }
        // メニュー画面
        if (key.key_esc_T == 1) {
            p.menumap = p.nowMap;
            p.nowMap = -1;
        }

        Input(&key);
        Draw(&p, &pic, &map,&e);
        Update(&p, &key, &map,&e);

        ClearScreen();
        FlipScreen();
        Sleep(16);
    }

    return 0;
}
